[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:82:17
             </Nav>
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="EnergyDrinks" id="appnavbar-energydrinks-dropdown" data-testid="appnavbar-energydrinks-dropdown" >
-                    <NavDropdown.Item href="/energydrinks/list" data-testid="appnavbar-energydrinks-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/energydrinks/create" data-testid="appnavbar-energydrinks-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="EnergyDrinks" id="appnavbar-energydrinks-dropdown" data-testid="appnavbar-energydrinks-dropdown">
+                    <NavDropdown.Item href="/energydrinks/list" data-testid="appnavbar-energydrinks-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/energydrinks/create" data-testid="appnavbar-energydrinks-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the energydrink menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-energydrinks-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:82:17
             </Nav>
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="EnergyDrinks" id="appnavbar-energydrinks-dropdown" data-testid="appnavbar-energydrinks-dropdown" >
-                    <NavDropdown.Item href="/energydrinks/list" data-testid="appnavbar-energydrinks-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/energydrinks/create" data-testid="appnavbar-energydrinks-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the energydrink menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-energydrinks-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:86:23
                   <NavDropdown title="EnergyDrinks" id="appnavbar-energydrinks-dropdown" data-testid="appnavbar-energydrinks-dropdown" >
                     <NavDropdown.Item href="/energydrinks/list" data-testid="appnavbar-energydrinks-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/energydrinks/create" data-testid="appnavbar-energydrinks-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the energydrink menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-energydrinks-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:86:23
                   <NavDropdown title="EnergyDrinks" id="appnavbar-energydrinks-dropdown" data-testid="appnavbar-energydrinks-dropdown" >
                     <NavDropdown.Item href="/energydrinks/list" data-testid="appnavbar-energydrinks-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/energydrinks/create" data-testid="appnavbar-energydrinks-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/energydrinks/create" data-testid="appnavbar-energydrinks-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the energydrink menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-energydrinks-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
