[Killed] StringLiteral
main/components/Energy Drinks/EnergyDrinkForm.js:10:73
 import axios from "axios";
 import AxiosMockAdapter from "axios-mock-adapter";
 
-function EnergyDrinkForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function EnergyDrinkForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     const navigate = useNavigate();
killedBy: EnergyDrinkCreatePage tests redirects to /energydrinks on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
