[Killed] BlockStatement
main/components/Energy Drinks/EnergyDrinkTable.js:13:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    energydrinkUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function EnergyDrinkTable({
killedBy: EnergyDrinkTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Energy Drinks/EnergyDrinkTable.js:22:20
     energydrinks,
     deleteCallback = defaultDeleteCallback,
     showButtons = true,
-    testIdPrefix = "EnergyDrinkTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: EnergyDrinkTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="EnergyDrinkTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Energy Drinks/EnergyDrinkTable.js:26:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/energydrinks/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: EnergyDrinkTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/energydrinks/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Energy Drinks/EnergyDrinkTable.js:31:39
         navigate(`/energydrinks/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/energydrinks/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: EnergyDrinkTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/energydrinks/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Energy Drinks/EnergyDrinkTable.js:33:18
 
     const detailsCallback = (cell) => {
         console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/energydrinks/details/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: EnergyDrinkTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/energydrinks/details/2"
Received: ""

Number of calls: 1

<html>
