[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:98:17
             </Nav>
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown">
-                    <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
-                      List
-                    </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                    )
-                    }
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the restaurants menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:103:22
                     <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
                       List
                     </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                    )
+                    {false
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the restaurants menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-restaurants-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
