[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:97:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown">
-                    <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">
-                      List
-                    </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                    )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the books menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-books-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:97:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown">
-                    <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">
-                      List
-                    </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                    )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown">
+                    <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">
+                      List
+                    </NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the books menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-books-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:102:22
                     <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">
                       List
                     </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                    )
+                    {true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the books menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-books-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:102:22
                     <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">
                       List
                     </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                    )
+                    {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the books menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-books-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:112:17
             </Nav>
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown">
-                    <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
-                      List
-                    </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                    )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown">
+                    <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
+                      List
+                    </NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the restaurants menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:112:17
             </Nav>
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown">
-                    <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
-                      List
-                    </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                    )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the restaurants menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:117:22
                     <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
                       List
                     </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                    )
+                    {true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the restaurants menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-restaurants-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:117:22
                     <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">
                       List
                     </NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_ADMIN") && (
-                      <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                    )
+                    {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the restaurants menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-restaurants-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
