[Killed] BlockStatement
main/pages/Energy Drinks/EnergyDrinkCreatePage.js:10:49
 import axios from "axios";
 import AxiosMockAdapter from "axios-mock-adapter";
 
-export default function EnergyDrinkCreatePage() {
-
-    let navigate = useNavigate();
-
-    const onSubmit = async (energydrink) => {
-        const createdEnergyDrink = energydrinkUtils.add(energydrink);
-        console.log("createdEnergyDrink: " + JSON.stringify(createdEnergyDrink));
-        navigate("/energydrinks");
-    }
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Create New EnergyDrink</h1>
-                <EnergyDrinkForm submitAction={onSubmit} />
-            </div>
-        </BasicLayout>
-    )
-}
+export default function EnergyDrinkCreatePage() {}
killedBy: EnergyDrinkCreatePage tests renders without crashing
statusReason: Error: EnergyDrinkCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Energy Drinks/EnergyDrinkCreatePage.js:14:45
 
     let navigate = useNavigate();
 
-    const onSubmit = async (energydrink) => {
-        const createdEnergyDrink = energydrinkUtils.add(energydrink);
-        console.log("createdEnergyDrink: " + JSON.stringify(createdEnergyDrink));
-        navigate("/energydrinks");
-    }
+    const onSubmit = async (energydrink) => {}
 
     return (
killedBy: EnergyDrinkCreatePage tests redirects to /energydrinks on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
