[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown" >
-                    <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>

[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown" >
-                    <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown">
+                    <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown" >
                     <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="Books" id="appnavbar-books-dropdown" data-testid="appnavbar-books-dropdown" >
                     <NavDropdown.Item href="/books/list" data-testid="appnavbar-books-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/books/create" data-testid="appnavbar-books-create">Create</NavDropdown.Item>
-                      )
+                      false
                     }
                   </NavDropdown>
