[Killed] BlockStatement
main/pages/Energy Drinks/EnergyDrinkDetailsPage.js:10:50
 import axios from "axios";
 import AxiosMockAdapter from "axios-mock-adapter";
 
-export default function EnergyDrinkDetailsPage() {
-  let { id } = useParams();
-
-  const response = energydrinkUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Energy Drink Details</h1>
-        <EnergyDrinkTable energydrinks={[response.energydrink]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function EnergyDrinkDetailsPage() {}
 
killedBy: EnergyDrinkDetailsPage tests renders without crashing
statusReason: Error: EnergyDrinkDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Energy Drinks/EnergyDrinkDetailsPage.js:19:78
     <BasicLayout>
       <div className="pt-2">
         <h1>Energy Drink Details</h1>
-        <EnergyDrinkTable energydrinks={[response.energydrink]} showButtons={false} />
+        <EnergyDrinkTable energydrinks={[response.energydrink]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: EnergyDrinkDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="EnergyDrinkTable-header-Delete"
  role="columnheader"
