[Killed] BlockStatement
main/pages/Energy Drinks/EnergyDrinkEditPage.js:12:47
 import AxiosMockAdapter from "axios-mock-adapter";
 
 
-export default function EnergyDrinkEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate();
-
-    const response = energydrinkUtils.getById(id);
-
-    const onSubmit = async (energydrink) => {
-        const updatedEnergyDrink = energydrinkUtils.update(energydrink);
-        console.log("updatedEnergyDrink: " + JSON.stringify(updatedEnergyDrink));
-        navigate("/energydrinks");
-    }
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit EnergyDrink</h1>
-                <EnergyDrinkForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.energydrink} />
-            </div>
-        </BasicLayout>
-    )
-}
+export default function EnergyDrinkEditPage() {}
killedBy: EnergyDrinkEditPage tests renders without crashing
statusReason: Error: EnergyDrinkEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Energy Drinks/EnergyDrinkEditPage.js:19:45
 
     const response = energydrinkUtils.getById(id);
 
-    const onSubmit = async (energydrink) => {
-        const updatedEnergyDrink = energydrinkUtils.update(energydrink);
-        console.log("updatedEnergyDrink: " + JSON.stringify(updatedEnergyDrink));
-        navigate("/energydrinks");
-    }
+    const onSubmit = async (energydrink) => {}
 
     return (
killedBy: EnergyDrinkEditPage tests redirects to /energydrinks on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
