[Killed] BlockStatement
main/pages/Energy Drinks/EnergyDrinkIndexPage.js:21:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`EnergyDrinkIndexPage deleteCallback: ${showCell(cell)})`);
-        energydrinkUtils.del(cell.row.values.id);
-        navigate("/energydrinks");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: EnergyDrinkIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Energy Drinks/EnergyDrinkIndexPage.js:22:21
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
     const deleteCallback = async (cell) => {
-        console.log(`EnergyDrinkIndexPage deleteCallback: ${showCell(cell)})`);
+        console.log(``);
         energydrinkUtils.del(cell.row.values.id);
         navigate("/energydrinks");
killedBy: EnergyDrinkIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(received).toMatch(expected)

Received string:    ""

[Killed] StringLiteral
main/pages/Energy Drinks/EnergyDrinkIndexPage.js:30:41
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/energydrinks/create">
+                <Button style={{ float: "" }} as={Link} to="/energydrinks/create">
                     Create Energy Drink
                 </Button>
killedBy: EnergyDrinkIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/Energy Drinks/EnergyDrinkIndexPage.js:30:32
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/energydrinks/create">
+                <Button style={{}} as={Link} to="/energydrinks/create">
                     Create Energy Drink
                 </Button>
killedBy: EnergyDrinkIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
