[Killed] BlockStatement
src/main/utils/energydrinkUtils.js:2:19
 // get energy drinks from local storage
-const get = () => {
-    const energydrinkValue = localStorage.getItem("energydrinks");//Gets the text of the value associated with the key "energydrinks" from browser local storage
-    if (energydrinkValue === undefined) {
-        const energydrinkCollection = { nextId: 1, energydrinks: [] }
-        return set(energydrinkCollection);
-    }
-    const energydrinkCollection = JSON.parse(energydrinkValue);
-    if (energydrinkCollection === null) {
-        const energydrinkCollection = { nextId: 1, energydrinks: [] }
-        return set(energydrinkCollection);
-    }
-    return energydrinkCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: EnergyDrinkTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'energydrinks')

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:4:9
 // get energy drinks from local storage
 const get = () => {
     const energydrinkValue = localStorage.getItem("energydrinks");//Gets the text of the value associated with the key "energydrinks" from browser local storage
-    if (energydrinkValue === undefined) {
+    if (true) {
         const energydrinkCollection = { nextId: 1, energydrinks: [] }
         return set(energydrinkCollection);
killedBy: energydrinkUtils tests get When energydrinks is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "energydrinks", "{\"nextId\":1,\"energydrinks\":[]}"

[Killed] EqualityOperator
src/main/utils/energydrinkUtils.js:4:9
 // get energy drinks from local storage
 const get = () => {
     const energydrinkValue = localStorage.getItem("energydrinks");//Gets the text of the value associated with the key "energydrinks" from browser local storage
-    if (energydrinkValue === undefined) {
+    if (energydrinkValue !== undefined) {
         const energydrinkCollection = { nextId: 1, energydrinks: [] }
         return set(energydrinkCollection);
killedBy: energydrinkUtils tests get When energydrinks is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:9:9
         return set(energydrinkCollection);
     }
     const energydrinkCollection = JSON.parse(energydrinkValue);
-    if (energydrinkCollection === null) {
+    if (false) {
         const energydrinkCollection = { nextId: 1, energydrinks: [] }
         return set(energydrinkCollection);
killedBy: energydrinkUtils tests get When energydrinks is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"energydrinks": [], "nextId": 1}
Received: null

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:9:9
         return set(energydrinkCollection);
     }
     const energydrinkCollection = JSON.parse(energydrinkValue);
-    if (energydrinkCollection === null) {
+    if (true) {
         const energydrinkCollection = { nextId: 1, energydrinks: [] }
         return set(energydrinkCollection);
killedBy: energydrinkUtils tests get When energydrinks is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "energydrinks", "{\"nextId\":1,\"energydrinks\":[]}"

[Killed] BlockStatement
src/main/utils/energydrinkUtils.js:16:25
     return energydrinkCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const energydrinkCollection = get();
-    const energydrinks = energydrinkCollection.energydrinks;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == id);
-    if (index === -1) {
-        return { "error": `energy drink with id ${id} not found` };
-    }
-    return { energydrink: energydrinks[index] };
-}
+const getById = (id) => {}
 
 // set energy drinks in local storage
killedBy: energydrinkUtils tests getById Check that getting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:24:49
     const energydrinks = energydrinkCollection.energydrinks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == id);
+    const index = energydrinks.findIndex((e) => true);
     if (index === -1) {
         return { "error": `energy drink with id ${id} not found` };
killedBy: energydrinkUtils tests getById Check that getting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "energydrink": Object {
-     "caffeine": "80 mg",

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:24:49
     const energydrinks = energydrinkCollection.energydrinks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == id);
+    const index = energydrinks.findIndex((e) => false);
     if (index === -1) {
         return { "error": `energy drink with id ${id} not found` };
killedBy: energydrinkUtils tests getById Check that getting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "energydrink": Object {
-     "caffeine": "80 mg",

[Killed] EqualityOperator
src/main/utils/energydrinkUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `energy drink with id ${id} not found` };
     }
killedBy: energydrinkUtils tests getById Check that getting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "energydrink": Object {
-     "caffeine": "80 mg",

[Killed] UnaryOperator
src/main/utils/energydrinkUtils.js:25:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `energy drink with id ${id} not found` };
     }
killedBy: energydrinkUtils tests getById Check that getting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "energydrink": Object {
-     "caffeine": "80 mg",

[Killed] BlockStatement
src/main/utils/energydrinkUtils.js:32:40
 }
 
 // set energy drinks in local storage
-const set = (energydrinkCollection) => {
-    localStorage.setItem("energydrinks", JSON.stringify(energydrinkCollection));
-    return energydrinkCollection;
-};
+const set = (energydrinkCollection) => {};
 
 // add a energy drink to local storage
killedBy: energydrinkUtils tests get When energydrinks is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"energydrinks": [], "nextId": 1}
Received: undefined

[Killed] BlockStatement
src/main/utils/energydrinkUtils.js:38:30
 };
 
 // add a energy drink to local storage
-const add = (energydrink) => {
-    const energydrinkCollection = get();
-    energydrink = { ...energydrink, id: energydrinkCollection.nextId };
-    energydrinkCollection.nextId++;
-    energydrinkCollection.energydrinks.push(energydrink);
-    set(energydrinkCollection);
-    return energydrink;
-};
+const add = (energydrink) => {};
 
 // update a energydrink in local storage
killedBy: energydrinkUtils tests add Starting from [], check that adding one energydrink works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] UpdateOperator
src/main/utils/energydrinkUtils.js:41:5
 const add = (energydrink) => {
     const energydrinkCollection = get();
     energydrink = { ...energydrink, id: energydrinkCollection.nextId };
-    energydrinkCollection.nextId++;
+    energydrinkCollection.nextId--;
     energydrinkCollection.energydrinks.push(energydrink);
     set(energydrinkCollection);
killedBy: energydrinkUtils tests add Starting from [], check that adding one energydrink works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 1

[Killed] BlockStatement
src/main/utils/energydrinkUtils.js:48:33
 };
 
 // update a energydrink in local storage
-const update = (energydrink) => {
-    const energydrinkCollection = get();
-
-    const energydrinks = energydrinkCollection.energydrinks;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == energydrink.id);
-    if (index === -1) {
-        return { "error": `energy drink with id ${energydrink.id} not found` };
-    }
-    energydrinks[index] = energydrink;
-    set(energydrinkCollection);
-    return { energydrinkCollection: energydrinkCollection };
-};
+const update = (energydrink) => {};
 
 // delete a energy drink from local storage
killedBy: energydrinkUtils tests update Check that updating an existing energydrink works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:54:49
     const energydrinks = energydrinkCollection.energydrinks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == energydrink.id);
+    const index = energydrinks.findIndex((e) => true);
     if (index === -1) {
         return { "error": `energy drink with id ${energydrink.id} not found` };
killedBy: energydrinkUtils tests update Check that updating an non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 22

  Object {
-   "error": "energy drink with id 99 not found",
+   "energydrinkCollection": Object {

[Killed] ArrowFunction
src/main/utils/energydrinkUtils.js:54:42
     const energydrinks = energydrinkCollection.energydrinks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == energydrink.id);
+    const index = energydrinks.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `energy drink with id ${energydrink.id} not found` };
killedBy: energydrinkUtils tests update Check that updating an existing energydrink works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "energydrinkCollection": Object {
-     "energydrinks": Array [

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == energydrink.id);
-    if (index === -1) {
+    if (false) {
         return { "error": `energy drink with id ${energydrink.id} not found` };
     }
killedBy: energydrinkUtils tests update Check that updating an non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "energy drink with id 99 not found",
+   "energydrinkCollection": Object {

[Killed] UnaryOperator
src/main/utils/energydrinkUtils.js:55:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == energydrink.id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `energy drink with id ${energydrink.id} not found` };
     }
killedBy: energydrinkUtils tests update Check that updating an non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "energy drink with id 99 not found",
+   "energydrinkCollection": Object {

[Killed] ObjectLiteral
src/main/utils/energydrinkUtils.js:56:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == energydrink.id);
     if (index === -1) {
-        return { "error": `energy drink with id ${energydrink.id} not found` };
+        return {};
     }
     energydrinks[index] = energydrink;
killedBy: energydrinkUtils tests update Check that updating an non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "energy drink with id 99 not found",
- }

[Killed] StringLiteral
src/main/utils/energydrinkUtils.js:56:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == energydrink.id);
     if (index === -1) {
-        return { "error": `energy drink with id ${energydrink.id} not found` };
+        return { "error": `` };
     }
     energydrinks[index] = energydrink;
killedBy: energydrinkUtils tests update Check that updating an non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "energy drink with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/energydrinkUtils.js:64:21
 };
 
 // delete a energy drink from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const energydrinkCollection = get();
-    const energydrinks = energydrinkCollection.energydrinks;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == id);
-    if (index === -1) {
-        return { "error": `energy drink with id ${id} not found` };
-    }
-    energydrinks.splice(index, 1);
-    set(energydrinkCollection);
-    return { energydrinkCollection: energydrinkCollection };
-};
+const del = (id) => {};
 
 const energydrinkUtils = {
killedBy: energydrinkUtils tests del Check that deleting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/energydrinkUtils.js:72:49
     const energydrinks = energydrinkCollection.energydrinks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == id);
+    const index = energydrinks.findIndex((e) => e.id != id);
     if (index === -1) {
         return { "error": `energy drink with id ${id} not found` };
killedBy: energydrinkUtils tests del Check that deleting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Object {
    "energydrinkCollection": Object {

[Killed] ArrowFunction
src/main/utils/energydrinkUtils.js:72:42
     const energydrinks = energydrinkCollection.energydrinks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = energydrinks.findIndex((e) => e.id == id);
+    const index = energydrinks.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `energy drink with id ${id} not found` };
killedBy: energydrinkUtils tests del Check that deleting a energydrink by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "energydrinkCollection": Object {
-     "energydrinks": Array [

[Killed] BlockStatement
src/main/utils/energydrinkUtils.js:73:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == id);
-    if (index === -1) {
-        return { "error": `energy drink with id ${id} not found` };
-    }
+    if (index === -1) {}
     energydrinks.splice(index, 1);
     set(energydrinkCollection);
killedBy: energydrinkUtils tests del Check that deleting a non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "energy drink with id 99 not found",
+   "energydrinkCollection": Object {

[Killed] ConditionalExpression
src/main/utils/energydrinkUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `energy drink with id ${id} not found` };
     }
killedBy: energydrinkUtils tests del Check that deleting a non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "energy drink with id 99 not found",
+   "energydrinkCollection": Object {

[Killed] ObjectLiteral
src/main/utils/energydrinkUtils.js:74:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = energydrinks.findIndex((e) => e.id == id);
     if (index === -1) {
-        return { "error": `energy drink with id ${id} not found` };
+        return {};
     }
     energydrinks.splice(index, 1);
killedBy: energydrinkUtils tests del Check that deleting a non-existing energydrink returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "energy drink with id 99 not found",
- }
