[Killed] BlockStatement
src/main/utils/useBackend.js:28:68
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData) {
-
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            // throw new Error("time out");
-            return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            console.error(errorMessage, e);
-            toast(errorMessage);
-            
-            throw e;
-        }
-    }, {
-        initialData
-    });
-}
+export function useBackend(queryKey, axiosParameters, initialData) {}
 
 // const wrappedParams = async (params) =>
killedBy: RestaurantIndexPage tests renders without crashing for regular user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/useBackend.js:30:43
 
 export function useBackend(queryKey, axiosParameters, initialData) {
 
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            // throw new Error("time out");
-            return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            console.error(errorMessage, e);
-            toast(errorMessage);
-            
-            throw e;
-        }
-    }, {
+    return useQuery(queryKey, async () => {}, {
         initialData
     });
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
src/main/utils/useBackend.js:35:21
             const response = await axios(axiosParameters);
             // throw new Error("time out");
             return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            console.error(errorMessage, e);
-            toast(errorMessage);
-            
-            throw e;
-        }
+        } catch (e) {}
     }, {
         initialData
killedBy: RestaurantIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/restaurants/all"
Received string:    "Error: Uncaught [TypeError: Cannot read properties of undefined (reading 'forEach')]
