[Killed] BooleanLiteral
main/components/Books/BookTable.js:13:21
 export default function BookTable({
     books,
     currentUser,
-    actionVisible = true
+    actionVisible = false
 }) {
 
killedBy: BookIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="BooksTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Books/BookTable.js:18:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/books/edit/${cell.row.values.id}`);
-    }
+    const editCallback = (cell) => {}
 
     const detailCallback = (cell) => {
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Books/BookTable.js:22:38
         navigate(`/books/edit/${cell.row.values.id}`);
     }
 
-    const detailCallback = (cell) => {
-        navigate(`/books/detail/${cell.row.values.id}`)
-    }
+    const detailCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests detail page button test
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/detail/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Books/BookTable.js:23:18
     }
 
     const detailCallback = (cell) => {
-        navigate(`/books/detail/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests detail page button test
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/detail/1"
Received: ""

Number of calls: 1

<html>
