[Killed] BooleanLiteral
main/components/EnergyDrinks/EnergyDrinkTable.js:8:87
 import { useNavigate } from "react-router-dom";
 import { hasRole } from "main/utils/currentUser";
 
-export default function EnergyDrinkTable({ energyDrinks, currentUser, actionVisible = true }) {
+export default function EnergyDrinkTable({ energyDrinks, currentUser, actionVisible = false }) {
 
     const navigate = useNavigate();
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="EnergyDrinkTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/EnergyDrinks/EnergyDrinkTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/energydrinks/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailCallback = (cell) => {
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/energydrinks/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/EnergyDrinks/EnergyDrinkTable.js:16:38
         navigate(`/energydrinks/edit/${cell.row.values.id}`)
     }
 
-    const detailCallback = (cell) => {
-        navigate(`/energydrinks/detail/${cell.row.values.id}`)
-    }
+    const detailCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests detail page button test
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/energydrinks/detail/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/EnergyDrinks/EnergyDrinkTable.js:17:18
     }
 
     const detailCallback = (cell) => {
-        navigate(`/energydrinks/detail/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests detail page button test
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/energydrinks/detail/2"
Received: ""

Number of calls: 1

<html>
