[Killed] BooleanLiteral
main/components/Restaurants/RestaurantTable.js:8:85
 import { useNavigate } from "react-router-dom";
 import { hasRole } from "main/utils/currentUser";
 
-export default function RestaurantTable({ restaurants, currentUser, actionVisible = true }) {
+export default function RestaurantTable({ restaurants, currentUser, actionVisible = false }) {
 
     const navigate = useNavigate();
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantsTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:16:38
         navigate(`/restaurants/edit/${cell.row.values.id}`)
     }
 
-    const detailCallback = (cell) => {
-        navigate(`/restaurants/detail/${cell.row.values.id}`)
-    }
+    const detailCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests detail page button test
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/detail/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:17:18
     }
 
     const detailCallback = (cell) => {
-        navigate(`/restaurants/detail/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests detail page button test
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/detail/1"
Received: ""

Number of calls: 1

<html>
