[Killed] ArrowFunction
main/pages/Books/BookCreatePage.js:9:33
 
 const BookCreatePage = () => {
 
-    const objectToAxiosParams = (book) => ({
-        url: "/api/books/post",
-        method: "POST",
-        params: {
-          title: book.title,
-          author: book.author,
-          date: book.date
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (book) => {
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Books/BookCreatePage.js:10:14
 const BookCreatePage = () => {
 
     const objectToAxiosParams = (book) => ({
-        url: "/api/books/post",
+        url: "",
         method: "POST",
         params: {
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Book Created - id: 15 title: some test title"

Number of calls: 0

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:19:33
         }
     });
 
-    const onSuccess = (book) => {
-        toast.success(`New Book Created - id: ${book.id} title: ${book.title}`);
-    }
+    const onSuccess = (book) => {}
 
     const mutation = useBackendMutation(
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Book Created - id: 15 title: some test title"

Number of calls: 0

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:33:42
     const { isSuccess } = mutation;
 
 
-    const onSubmit = async (formData) => {
-        mutation.mutate(formData)
-    }
+    const onSubmit = async (formData) => {}
 
     if (isSuccess) {
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
