[Killed] BlockStatement
main/pages/Books/BookDetailPage.js:7:42
 import { useBackend } from "main/utils/useBackend";
 import { useCurrentUser } from 'main/utils/currentUser';
 
-export default function BookDetailPage() {
-  let { id } = useParams();
-
-  const currentUser = useCurrentUser();
-
-  const { data: book, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    [`/api/books/detail/${id}`],
-    { method: "GET", url: `/api/books?id=${id}` },
-    []
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Book Details</h1>
-        <BookTable books={[book]} currentUser={currentUser} actionVisible={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function BookDetailPage() {}
killedBy: BookDetailPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: BookDetailPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Books/BookDetailPage.js:24:76
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        <BookTable books={[book]} currentUser={currentUser} actionVisible={false} />
+        <BookTable books={[book]} currentUser={currentUser} actionVisible={true} />
       </div>
     </BasicLayout>
killedBy: BookDetailPage tests loads the correct fields, and no buttons, admin user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="BooksTable-cell-row-0-col-Detail-button" type="button">Detail</button> instead

[Killed] ArrayDeclaration
main/pages/Books/BookDetailPage.js:24:27
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        <BookTable books={[book]} currentUser={currentUser} actionVisible={false} />
+        <BookTable books={[]} currentUser={currentUser} actionVisible={false} />
       </div>
     </BasicLayout>
killedBy: BookDetailPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: Unable to find an element by: [data-testid="BooksTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
