[Killed] ArrowFunction
main/pages/Books/BookEditPage.js:24:36
       }
     );
 
-    const objectToAxiosPutParams = (book) => ({
-        url: "/api/books",
-        method: "PUT",
-        params: {
-            id: book.id,
-        },
-        data: {
-            title: book.title,
-            author: book.author,
-            date: book.date
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (book) => {
killedBy: BookEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book Updated - id: 17 title: some test title 19"

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Books/BookEditPage.js:27:17
     const objectToAxiosPutParams = (book) => ({
         url: "/api/books",
         method: "PUT",
-        params: {
-            id: book.id,
-        },
+        params: {},
         data: {
             title: book.title,
killedBy: BookEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:37:33
         }
     });
 
-    const onSuccess = (book) => {
-        toast.success(`Book Updated - id: ${book.id} title: ${book.title}`);
-    }
+    const onSuccess = (book) => {}
 
     const mutation = useBackendMutation(
killedBy: BookEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book Updated - id: 17 title: some test title 19"

Number of calls: 0

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:49:20
     )
     const {isSuccess} = mutation
 
-    if (isSuccess) {
-        return <Navigate to="/books/list"/>
-    }
+    if (isSuccess) {}
 
     const onSubmit = async (formData) => {
killedBy: BookEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/books/list"}

Number of calls: 0

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:53:42
         return <Navigate to="/books/list"/>
     }
 
-    const onSubmit = async (formData) => {
-        mutation.mutate(formData);
-    }
+    const onSubmit = async (formData) => {}
 
     return (
killedBy: BookEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book Updated - id: 17 title: some test title 19"

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Books/BookEditPage.js:61:18
         <BasicLayout>
             <div className="pt-2 pb-3">
                 <h1>Edit Book</h1>
-                {book && 
-                <BookForm submitAction={onSubmit} buttonLabel="Update" initialContents={book} /> 
+                {true 
                 }
             </div>
killedBy: BookEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="BookForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Books/BookEditPage.js:61:18
         <BasicLayout>
             <div className="pt-2 pb-3">
                 <h1>Edit Book</h1>
-                {book && 
-                <BookForm submitAction={onSubmit} buttonLabel="Update" initialContents={book} /> 
+                {false 
                 }
             </div>
killedBy: BookEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="BookForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
