[Killed] BlockStatement
main/pages/Books/BookIndexPage.js:7:41
 import { useBackend } from 'main/utils/useBackend';
 import { useCurrentUser } from 'main/utils/currentUser';
 
-export default function BookIndexPage() {
-
-    const currentUser = useCurrentUser();
-
-    const { data: books, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      ["/api/books/all"],
-      { method: "GET", url: "/api/books/all" },
-      []
-    );
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Books</h1>
-                <BookTable books={books} currentUser={currentUser} />
-            </div>
-        </BasicLayout>
-    )
-}
+export default function BookIndexPage() {}
killedBy: BookIndexPage tests renders without crashing for regular user
statusReason: Error: BookIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
