[Killed] ArrowFunction
main/pages/EnergyDrinks/EnergyDrinkCreatePage.js:9:31
 
 export default function EnergyDrinkCreatePage() {
 
-  const objectToAxiosParams = (energyDrink) => ({
-    url: "/api/energydrinks/post",
-    method: "POST",
-    params: {
-      name: energyDrink.name,
-      caffeine: energyDrink.caffeine,
-      description: energyDrink.description
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (energyDrink) => {
killedBy: EnergyDrinkCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/EnergyDrinks/EnergyDrinkCreatePage.js:10:10
 export default function EnergyDrinkCreatePage() {
 
   const objectToAxiosParams = (energyDrink) => ({
-    url: "/api/energydrinks/post",
+    url: "",
     method: "POST",
     params: {
killedBy: EnergyDrinkCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New energyDrink Created - id: 17 name: RedBull Dupe"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/EnergyDrinks/EnergyDrinkCreatePage.js:12:13
   const objectToAxiosParams = (energyDrink) => ({
     url: "/api/energydrinks/post",
     method: "POST",
-    params: {
-      name: energyDrink.name,
-      caffeine: energyDrink.caffeine,
-      description: energyDrink.description
-    }
+    params: {}
   });
 
killedBy: EnergyDrinkCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "caffeine": "6000 mg",
-   "description": "RandDrink is very good for you, better than RedBull",

[Killed] BlockStatement
main/pages/EnergyDrinks/EnergyDrinkCreatePage.js:19:38
     }
   });
 
-  const onSuccess = (energyDrink) => {
-    toast(`New energyDrink Created - id: ${energyDrink.id} name: ${energyDrink.name}`);
-  }
+  const onSuccess = (energyDrink) => {}
 
   const mutation = useBackendMutation(
killedBy: EnergyDrinkCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New energyDrink Created - id: 17 name: RedBull Dupe"

Number of calls: 0

[Killed] StringLiteral
main/pages/EnergyDrinks/EnergyDrinkCreatePage.js:20:11
   });
 
   const onSuccess = (energyDrink) => {
-    toast(`New energyDrink Created - id: ${energyDrink.id} name: ${energyDrink.name}`);
+    toast(``);
   }
 
killedBy: EnergyDrinkCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New energyDrink Created - id: 17 name: RedBull Dupe"
Received: ""

Number of calls: 1
