[Killed] BlockStatement
main/pages/EnergyDrinks/EnergyDrinkDetailsPage.js:7:50
 import { useBackend } from "main/utils/useBackend";
 import { useCurrentUser } from 'main/utils/currentUser';
 
-export default function EnergyDrinkDetailsPage() {
-  let { id } = useParams();
-
-  const currentUser = useCurrentUser();
-
-  const { data: energyDrinks, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    [`/api/energydrinks/detail/${id}`],
-    { method: "GET", url: `/api/energydrinks?id=${id}` },
-    []
-  );
-
-  
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Energy Drink Details</h1>
-        <EnergyDrinkTable energyDrinks={[energyDrinks]} currentUser={currentUser} actionVisible={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function EnergyDrinkDetailsPage() {}
 
killedBy: EnergyDrinkDetailsPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: EnergyDrinkDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/EnergyDrinks/EnergyDrinkDetailsPage.js:16:27
   useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/energydrinks/detail/${id}`],
-    { method: "GET", url: `/api/energydrinks?id=${id}` },
+    { method: "GET", url: `` },
     []
   );
killedBy: EnergyDrinkDetailsPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:


<html>

[Killed] StringLiteral
main/pages/EnergyDrinks/EnergyDrinkDetailsPage.js:16:15
   useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/energydrinks/detail/${id}`],
-    { method: "GET", url: `/api/energydrinks?id=${id}` },
+    { method: "", url: `/api/energydrinks?id=${id}` },
     []
   );
killedBy: EnergyDrinkDetailsPage tests toast error notification and console error message when id doesn't exit in database
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/energydrinks?id=3"
Received string:    "Error communicating with backend via  on /api/energydrinks?id=3"

[Killed] BooleanLiteral
main/pages/EnergyDrinks/EnergyDrinkDetailsPage.js:25:98
     <BasicLayout>
       <div className="pt-2">
         <h1>Energy Drink Details</h1>
-        <EnergyDrinkTable energyDrinks={[energyDrinks]} currentUser={currentUser} actionVisible={false} />
+        <EnergyDrinkTable energyDrinks={[energyDrinks]} currentUser={currentUser} actionVisible={true} />
       </div>
     </BasicLayout>
killedBy: EnergyDrinkDetailsPage tests loads the correct fields, and no buttons, admin user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="EnergyDrinkTable-cell-row-0-col-Detail-button" type="button">Detail</button> instead

[Killed] ArrayDeclaration
main/pages/EnergyDrinks/EnergyDrinkDetailsPage.js:25:41
     <BasicLayout>
       <div className="pt-2">
         <h1>Energy Drink Details</h1>
-        <EnergyDrinkTable energyDrinks={[energyDrinks]} currentUser={currentUser} actionVisible={false} />
+        <EnergyDrinkTable energyDrinks={[]} currentUser={currentUser} actionVisible={false} />
       </div>
     </BasicLayout>
killedBy: EnergyDrinkDetailsPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: Unable to find an element by: [data-testid="EnergyDrinkTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
