[Killed] ObjectLiteral
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don'tgit  test internal caching of React Query
       [`/api/energydrinks?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/energydrinks`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="EnergyDrinkForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/energydrinks`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="EnergyDrinkForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (energyDrink) => ({
-    url: "/api/energydrinks",
-    method: "PUT",
-    params: {
-      id: energyDrink.id,
-    },
-    data: {
-      name: energyDrink.name,
-      description: energyDrink.description,
-      caffeine: energyDrink.caffeine
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (energyDrink) => {
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "EnergyDrink Updated - id: 17 name: some test name 19"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:25:52
     );
 
 
-  const objectToAxiosPutParams = (energyDrink) => ({
-    url: "/api/energydrinks",
-    method: "PUT",
-    params: {
-      id: energyDrink.id,
-    },
-    data: {
-      name: energyDrink.name,
-      description: energyDrink.description,
-      caffeine: energyDrink.caffeine
-    }
-  });
+  const objectToAxiosPutParams = (energyDrink) => ({});
 
   const onSuccess = (energyDrink) => {
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "EnergyDrink Updated - id: 17 name: some test name 19"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:38:38
     }
   });
 
-  const onSuccess = (energyDrink) => {
-    toast(`EnergyDrink Updated - id: ${energyDrink.id} name: ${energyDrink.name}`);
-  }
+  const onSuccess = (energyDrink) => {}
 
   const mutation = useBackendMutation(
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "EnergyDrink Updated - id: 17 name: some test name 19"

Number of calls: 0

[Killed] StringLiteral
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:39:11
   });
 
   const onSuccess = (energyDrink) => {
-    toast(`EnergyDrink Updated - id: ${energyDrink.id} name: ${energyDrink.name}`);
+    toast(``);
   }
 
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "EnergyDrink Updated - id: 17 name: some test name 19"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:51:18
 
   const { isSuccess } = mutation
 
-  if (isSuccess) {
-    return <Navigate to="/energydrinks/list" />
-  }
+  if (isSuccess) {}
 
   const onSubmit = async (data) => {
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/energydrinks/list"}

Number of calls: 0

[Killed] LogicalOperator
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:64:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Energy Drink</h1>
-        {energyDrink &&
-          <EnergyDrinkForm initialContents={energyDrink} submitAction={onSubmit} buttonLabel="Update" />
+        {energyDrink || <EnergyDrinkForm initialContents={energyDrink} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: EnergyDrinkEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="EnergyDrinkForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/EnergyDrinks/EnergyDrinkEditPage.js:64:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Energy Drink</h1>
-        {energyDrink &&
-          <EnergyDrinkForm initialContents={energyDrink} submitAction={onSubmit} buttonLabel="Update" />
+        {true
         }
       </div>
killedBy: EnergyDrinkEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="EnergyDrinkForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
