[Killed] BlockStatement
main/pages/EnergyDrinks/EnergyDrinkIndexPage.js:8:48
 import EnergyDrinkTable from 'main/components/EnergyDrinks/EnergyDrinkTable';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function EnergyDrinkIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: energyDrinks, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      ["/api/energydrinks/all"],
-      { method: "GET", url: "/api/energydrinks/all" },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Restaurants</h1>
-        <EnergyDrinkTable energyDrinks={energyDrinks} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function EnergyDrinkIndexPage() {}
killedBy: EnergyDrinkIndexPage tests renders without crashing for regular user
statusReason: Error: EnergyDrinkIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/EnergyDrinks/EnergyDrinkIndexPage.js:16:29
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/energydrinks/all"],
-      { method: "GET", url: "/api/energydrinks/all" },
+      { method: "GET", url: "" },
       []
     );
killedBy: EnergyDrinkIndexPage tests renders three energy drinks without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="EnergyDrinkTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/EnergyDrinks/EnergyDrinkIndexPage.js:16:17
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/energydrinks/all"],
-      { method: "GET", url: "/api/energydrinks/all" },
+      { method: "", url: "/api/energydrinks/all" },
       []
     );
killedBy: EnergyDrinkIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/energydrinks/all"
Received string:    "Error communicating with backend via  on /api/energydrinks/all"
