[Killed] BlockStatement
main/pages/Restaurants/RestaurantDetailPage.js:7:48
 import { useBackend } from "main/utils/useBackend";
 import { useCurrentUser } from 'main/utils/currentUser';
 
-export default function RestaurantDetailPage() {
-  let { id } = useParams();
-
-  const currentUser = useCurrentUser();
-
-  const { data: restaurant, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      [`/api/restaurants/detail/${id}`],
-      { method: "GET", url: `/api/restaurants?id=${id}` },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[restaurant]} currentUser={currentUser} actionVisible={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RestaurantDetailPage() {}
killedBy: RestaurantDetailPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: RestaurantDetailPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Restaurants/RestaurantDetailPage.js:24:94
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[restaurant]} currentUser={currentUser} actionVisible={false} />
+        <RestaurantTable restaurants={[restaurant]} currentUser={currentUser} actionVisible={true} />
       </div>
     </BasicLayout>
killedBy: RestaurantDetailPage tests loads the correct fields, and no buttons, admin user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RestaurantsTable-cell-row-0-col-Detail-button" type="button">Detail</button> instead

[Killed] ArrayDeclaration
main/pages/Restaurants/RestaurantDetailPage.js:24:39
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={[restaurant]} currentUser={currentUser} actionVisible={false} />
+        <RestaurantTable restaurants={[]} currentUser={currentUser} actionVisible={false} />
       </div>
     </BasicLayout>
killedBy: RestaurantDetailPage tests loads the correct fields, and no buttons, not admin
statusReason: Error: Unable to find an element by: [data-testid="RestaurantsTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
