[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/restaurants`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/restaurants",
-    method: "PUT",
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: some test name 19"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:25:51
     );
 
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/restaurants",
-    method: "PUT",
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description
-    }
-  });
+  const objectToAxiosPutParams = (restaurant) => ({});
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: some test name 19"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Restaurants/RestaurantEditPage.js:27:13
 
   const objectToAxiosPutParams = (restaurant) => ({
     url: "/api/restaurants",
-    method: "PUT",
+    method: "",
     params: {
       id: restaurant.id,
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: some test name 19"
Received: "Restaurant Updated - id: 17 name: some test name 17"

Number of calls: 1

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:50:18
 
   const { isSuccess } = mutation
 
-  if (isSuccess) {
-    return <Navigate to="/restaurants/list" />
-  }
+  if (isSuccess) {}
 
   const onSubmit = async (data) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants/list"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:63:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant &&
-          <RestaurantForm initialContents={restaurant} submitAction={onSubmit} buttonLabel="Update" />
+        {false
         }
       </div>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantEditPage.js:63:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant &&
-          <RestaurantForm initialContents={restaurant} submitAction={onSubmit} buttonLabel="Update" />
+        {restaurant || <RestaurantForm initialContents={restaurant} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: RestaurantEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="RestaurantForm-name" id="name" name="name" type="text" /> instead
