[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.js:8:47
 import RestaurantsTable from 'main/components/Restaurants/RestaurantTable';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function RestaurantIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: restaurants, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      ["/api/restaurants/all"],
-      { method: "GET", url: "/api/restaurants/all" },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Restaurants</h1>
-        <RestaurantsTable restaurants={restaurants} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RestaurantIndexPage() {}
killedBy: RestaurantIndexPage tests renders without crashing for regular user
statusReason: Error: RestaurantIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
