[Killed] BlockStatement
src/main/utils/useBackend.js:28:68
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData) {
-
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            // throw new Error("time out");
-            return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            console.error(errorMessage, e);
-            toast(errorMessage);
-            throw e;
-        }
-    }, {
-        initialData
-    });
-}
+export function useBackend(queryKey, axiosParameters, initialData) {}
 
 // const wrappedParams = async (params) =>
killedBy: RestaurantIndexPage tests renders without crashing for regular user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/useBackend.js:30:43
 
 export function useBackend(queryKey, axiosParameters, initialData) {
 
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            // throw new Error("time out");
-            return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            console.error(errorMessage, e);
-            toast(errorMessage);
-            throw e;
-        }
-    }, {
+    return useQuery(queryKey, async () => {}, {
         initialData
     });
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BlockStatement
src/main/utils/useBackend.js:31:13
 export function useBackend(queryKey, axiosParameters, initialData) {
 
     return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            // throw new Error("time out");
-            return response.data;
-        } catch (e) {
+        try {} catch (e) {
             const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
             console.error(errorMessage, e);
killedBy: BookIndexPage tests renders three books without crashing for regular user
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/main/utils/useBackend.js:35:21
             const response = await axios(axiosParameters);
             // throw new Error("time out");
             return response.data;
-        } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-            console.error(errorMessage, e);
-            toast(errorMessage);
-            throw e;
-        }
+        } catch (e) {}
     }, {
         initialData
killedBy: BookIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/books/all"
Received string:    "Error: Uncaught [TypeError: Cannot read properties of undefined (reading 'forEach')]

[Killed] StringLiteral
src/main/utils/useBackend.js:36:34
             // throw new Error("time out");
             return response.data;
         } catch (e) {
-            const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
+            const errorMessage = ``;
             console.error(errorMessage, e);
             toast(errorMessage);
killedBy: BookIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/books/all"
Received string:    ""

[Killed] BlockStatement
src/main/utils/useBackend.js:65:91
     }
 };
 
-export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {
-    const queryClient = useQueryClient();
-
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (data) => {
-            toast(`${data}`);
-        },
-        // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            if (queryKey!==null){ 
-                queryClient.invalidateQueries(queryKey);
-            }
-        },
-        // Stryker enable all
-        retry: false,
-        ...useMutationParams
-    })
-}
+export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {}
 
 
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[Killed] ObjectLiteral
src/main/utils/useBackend.js:68:80
 export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {
     const queryClient = useQueryClient();
 
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (data) => {
-            toast(`${data}`);
-        },
-        // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            if (queryKey!==null){ 
-                queryClient.invalidateQueries(queryKey);
-            }
-        },
-        // Stryker enable all
-        retry: false,
-        ...useMutationParams
-    })
+    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {})
 }
 
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant with id 1 was deleted"

Number of calls: 0

<html>
  <head />
