[Killed] BlockStatement
src/main/utils/bookUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-    console.log(message.message);
-    toast.success(message.message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: BookIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
src/main/utils/bookUtils.js:8:47
     toast.success(message.message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/books",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: BookIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book with id 1 was deleted"

Number of calls: 0

<html>
  <head />
