[Killed] BlockStatement
main/components/Books/BookTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    bookUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function BookTable({
killedBy: BookTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Books/BookTable.js:22:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/books/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: BookTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Books/BookTable.js:27:39
         navigate(`/books/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/books/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: BookTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Books/BookTable.js:29:18
 
     const detailsCallback = (cell) => {
         console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/books/details/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: BookTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books/details/2"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Books/BookTable.js:43:21
             accessor: 'title',
         },
         {
-            Header: 'Description',
+            Header: "",
             accessor: 'description',
         },
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Description. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Books/BookTable.js:52:23
         },
         {
             Header: 'Date',
-            accessor: 'date'
+            accessor: ""
         },
         {
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-date"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Books/BookTable.js:54:9
             Header: 'Date',
             accessor: 'date'
         },
-        {
-            Header: 'Publisher',
-            accessor: 'publisher'
-        }
+        {}
     ];
 
killedBy: BookTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Books/BookTable.js:62:33
 
     const buttonColumns = [
         ...columns,
-        ButtonColumn("Details", "primary", detailsCallback, testIdPrefix),
+        ButtonColumn("Details", "", detailsCallback, testIdPrefix),
         ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
         ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Books/BookTable.js:63:30
     const buttonColumns = [
         ...columns,
         ButtonColumn("Details", "primary", detailsCallback, testIdPrefix),
-        ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
+        ButtonColumn("Edit", "", editCallback, testIdPrefix),
         ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
     ]
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Books/BookTable.js:64:32
         ...columns,
         ButtonColumn("Details", "primary", detailsCallback, testIdPrefix),
         ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
-        ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
+        ButtonColumn("Delete", "", deleteCallback, testIdPrefix),
     ]
 
killedBy: BookTable tests Has the expected column headers, content and buttons
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
