[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:6:30
 import { useNavigate } from "react-router-dom";
 import { bookUtils} from "main/utils/bookUtils";
 
-const BookCreatePage = () => {
-    let navigate = useNavigate();
-
-    const onSubmit = async (formData) => {
-        const createdBook = bookUtils.add(formData);
-        console.log("createdBook: ", JSON.stringify(createdBook));
-        navigate("/books");
-    }
-
-    return (
-        <BasicLayout>
-            <div className="pt-2 pb-3">
-                <h1>Create New Book</h1>
-                <BookForm submitAction={onSubmit} />
-            </div>
-        </BasicLayout>
-    )
-}
+const BookCreatePage = () => {}
 
 export default BookCreatePage;
killedBy: BookCreatePage tests renders without crashing
statusReason: Error: BookCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:9:42
 const BookCreatePage = () => {
     let navigate = useNavigate();
 
-    const onSubmit = async (formData) => {
-        const createdBook = bookUtils.add(formData);
-        console.log("createdBook: ", JSON.stringify(createdBook));
-        navigate("/books");
-    }
+    const onSubmit = async (formData) => {}
 
     return (
killedBy: BookCreatePage tests redirects to /books on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
