[Killed] BlockStatement
main/pages/Books/BookDetailsPage.js:6:43
 import BookTable from 'main/components/Books/BookTable';
 import { bookUtils } from 'main/utils/bookUtils';
 
-export default function BookDetailsPage() {
-  let { id } = useParams();
-
-  const response = bookUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Book Details</h1>
-        <BookTable books={[response.book]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function BookDetailsPage() {}
 
killedBy: BookDetailsPage tests renders without crashing
statusReason: Error: BookDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Books/BookDetailsPage.js:15:57
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        <BookTable books={[response.book]} showButtons={false} />
+        <BookTable books={[response.book]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: BookDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="BookTable-header-Delete"
  role="columnheader"

[Killed] ArrayDeclaration
main/pages/Books/BookDetailsPage.js:15:27
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        <BookTable books={[response.book]} showButtons={false} />
+        <BookTable books={[]} showButtons={false} />
       </div>
     </BasicLayout>
killedBy: BookDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: To Kill a Mockingbird. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
