[Killed] BlockStatement
main/pages/Books/BookEditPage.js:7:28
 import BookForm from "main/components/Books/BookForm";
 import { useNavigate } from "react-router-dom";
 
-const BookEditPage = () => {
-    let { id } = useParams();
-
-    let navigate = useNavigate();
-
-    const response = bookUtils.getById(id);
-
-    const onSubmit = async (formData) => {
-        const createdBook = bookUtils.update(formData);
-        console.log("updatedBook: ", JSON.stringify(createdBook));
-        navigate("/books");
-    }
-
-    return (
-        <BasicLayout>
-            <div className="pt-2 pb-3">
-                <h1>Edit Book</h1>
-                <BookForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.book} />
-            </div>
-        </BasicLayout>
-    )
-}
+const BookEditPage = () => {}
 
 export default BookEditPage;
killedBy: BookEditPage tests renders without crashing
statusReason: Error: BookEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:14:42
 
     const response = bookUtils.getById(id);
 
-    const onSubmit = async (formData) => {
-        const createdBook = bookUtils.update(formData);
-        console.log("updatedBook: ", JSON.stringify(createdBook));
-        navigate("/books");
-    }
+    const onSubmit = async (formData) => {}
 
     return (
killedBy: BookEditPage tests redirects to /books on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Books/BookEditPage.js:17:18
     const onSubmit = async (formData) => {
         const createdBook = bookUtils.update(formData);
         console.log("updatedBook: ", JSON.stringify(createdBook));
-        navigate("/books");
+        navigate("");
     }
 
killedBy: BookEditPage tests redirects to /books on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Books/BookEditPage.js:24:64
         <BasicLayout>
             <div className="pt-2 pb-3">
                 <h1>Edit Book</h1>
-                <BookForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.book} />
+                <BookForm submitAction={onSubmit} buttonLabel={""} initialContents={response.book} />
             </div>
         </BasicLayout>
killedBy: BookEditPage tests redirects to /books on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
