[Killed] BlockStatement
main/pages/Books/BookIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`BookIndexPage deleteCallback: ${showCell(cell)})`);
-        bookUtils.del(cell.row.values.id);
-        navigate("/Books");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: BookIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Books/BookIndexPage.js:18:21
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
     const deleteCallback = async (cell) => {
-        console.log(`BookIndexPage deleteCallback: ${showCell(cell)})`);
+        console.log(``);
         bookUtils.del(cell.row.values.id);
         navigate("/Books");
killedBy: BookIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "BookIndexPage deleteCallback: {\"id\":3,\"title\":\"Mocking Freebirds\",\"description\":\"Mock\",\"author\":\"Tim\",\"date\":\"2023-04-27\",\"publisher\":\"yuh\"}"
Received string:    ""

[Killed] StringLiteral
main/pages/Books/BookIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`BookIndexPage deleteCallback: ${showCell(cell)})`);
         bookUtils.del(cell.row.values.id);
-        navigate("/Books");
+        navigate("");
     }
 
killedBy: BookIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/Books"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Books/BookIndexPage.js:26:41
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/books/create">
+                <Button style={{ float: "" }} as={Link} to="/books/create">
                     Create Book
                 </Button>
killedBy: BookIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
