[Killed] BlockStatement
src/main/utils/bookUtils.js:2:19
 // get books from local storage
-const get = () => {
-    const bookValue = localStorage.getItem("books");
-    if (bookValue === undefined) {
-        const bookCollection = { nextId: 1, books: [] }
-        return set(bookCollection);
-    }
-    const bookCollection = JSON.parse(bookValue);
-    if (bookCollection === null) {
-        const bookCollection = { nextId: 1, books: [] }
-        return set(bookCollection);
-    }
-    return bookCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: BookTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'books')

[Killed] BlockStatement
src/main/utils/bookUtils.js:4:34
 // get books from local storage
 const get = () => {
     const bookValue = localStorage.getItem("books");
-    if (bookValue === undefined) {
-        const bookCollection = { nextId: 1, books: [] }
-        return set(bookCollection);
-    }
+    if (bookValue === undefined) {}
     const bookCollection = JSON.parse(bookValue);
     if (bookCollection === null) {
killedBy: bookUtils tests get When books is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] EqualityOperator
src/main/utils/bookUtils.js:4:9
 // get books from local storage
 const get = () => {
     const bookValue = localStorage.getItem("books");
-    if (bookValue === undefined) {
+    if (bookValue !== undefined) {
         const bookCollection = { nextId: 1, books: [] }
         return set(bookCollection);
killedBy: bookUtils tests get When books is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ArrayDeclaration
src/main/utils/bookUtils.js:5:52
 const get = () => {
     const bookValue = localStorage.getItem("books");
     if (bookValue === undefined) {
-        const bookCollection = { nextId: 1, books: [] }
+        const bookCollection = { nextId: 1, books: ["Stryker was here"] }
         return set(bookCollection);
     }
killedBy: bookUtils tests get When books is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "books": Array [],
+   "books": Array [

[Killed] ConditionalExpression
src/main/utils/bookUtils.js:9:9
         return set(bookCollection);
     }
     const bookCollection = JSON.parse(bookValue);
-    if (bookCollection === null) {
+    if (true) {
         const bookCollection = { nextId: 1, books: [] }
         return set(bookCollection);
killedBy: bookUtils tests get When books is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "books", "{\"nextId\":1,\"books\":[]}"

[Killed] ConditionalExpression
src/main/utils/bookUtils.js:9:9
         return set(bookCollection);
     }
     const bookCollection = JSON.parse(bookValue);
-    if (bookCollection === null) {
+    if (false) {
         const bookCollection = { nextId: 1, books: [] }
         return set(bookCollection);
killedBy: bookUtils tests get When books is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"books": [], "nextId": 1}
Received: null

[Killed] ArrayDeclaration
src/main/utils/bookUtils.js:10:52
     }
     const bookCollection = JSON.parse(bookValue);
     if (bookCollection === null) {
-        const bookCollection = { nextId: 1, books: [] }
+        const bookCollection = { nextId: 1, books: ["Stryker was here"] }
         return set(bookCollection);
     }
killedBy: bookUtils tests get When books is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "books": Array [],
+   "books": Array [

[Killed] BlockStatement
src/main/utils/bookUtils.js:16:25
     return bookCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const bookCollection = get();
-    const books = bookCollection.books;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = books.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `book with id ${id} not found` };
-    }
-    return { book: books[index] };
-}
+const getById = (id) => {}
 
 // set books in local storage
killedBy: bookUtils tests getById Check that getting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] EqualityOperator
src/main/utils/bookUtils.js:17:9
 };
 
 const getById = (id) => {
-    if (id === undefined) {
+    if (id !== undefined) {
         return { "error": "id is a required parameter" };
     }
killedBy: bookUtils tests getById Check that getting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

  Object {
-   "book": Object {
-     "author": "Harper Lee",

[Killed] StringLiteral
src/main/utils/bookUtils.js:18:27
 
 const getById = (id) => {
     if (id === undefined) {
-        return { "error": "id is a required parameter" };
+        return { "error": "" };
     }
     const bookCollection = get();
killedBy: bookUtils tests getById Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "id is a required parameter",
+   "error": "",

[Killed] ArrowFunction
src/main/utils/bookUtils.js:24:35
     const books = bookCollection.books;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = books.findIndex((r) => r.id == id);
+    const index = books.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `book with id ${id} not found` };
killedBy: bookUtils tests getById Check that getting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

  Object {
-   "book": Object {
-     "author": "Harper Lee",

[Killed] ConditionalExpression
src/main/utils/bookUtils.js:24:42
     const books = bookCollection.books;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = books.findIndex((r) => r.id == id);
+    const index = books.findIndex((r) => true);
     if (index === -1) {
         return { "error": `book with id ${id} not found` };
killedBy: bookUtils tests getById Check that getting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Object {
    "book": Object {
-     "author": "Harper Lee",

[Killed] ConditionalExpression
src/main/utils/bookUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `book with id ${id} not found` };
     }
killedBy: bookUtils tests getById Check that getting a non-existing book returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "book with id 99 not found",
+   "book": undefined,

[Killed] BlockStatement
src/main/utils/bookUtils.js:25:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `book with id ${id} not found` };
-    }
+    if (index === -1) {}
     return { book: books[index] };
 }
killedBy: bookUtils tests getById Check that getting a non-existing book returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "book with id 99 not found",
+   "book": undefined,

[Killed] ObjectLiteral
src/main/utils/bookUtils.js:26:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `book with id ${id} not found` };
+        return {};
     }
     return { book: books[index] };
killedBy: bookUtils tests getById Check that getting a non-existing book returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "book with id 99 not found",
- }

[Killed] StringLiteral
src/main/utils/bookUtils.js:26:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `book with id ${id} not found` };
+        return { "error": `` };
     }
     return { book: books[index] };
killedBy: bookUtils tests getById Check that getting a non-existing book returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "book with id 99 not found",
+   "error": "",

[Killed] ObjectLiteral
src/main/utils/bookUtils.js:28:12
     if (index === -1) {
         return { "error": `book with id ${id} not found` };
     }
-    return { book: books[index] };
+    return {};
 }
 
killedBy: bookUtils tests getById Check that getting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Object {
-   "book": Object {
-     "author": "Harper Lee",

[Killed] BlockStatement
src/main/utils/bookUtils.js:32:33
 }
 
 // set books in local storage
-const set = (bookCollection) => {
-    localStorage.setItem("books", JSON.stringify(bookCollection));
-    return bookCollection;
-};
+const set = (bookCollection) => {};
 
 // add a book to local storage
killedBy: bookUtils tests get When books is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"books": [], "nextId": 1}
Received: undefined

[Killed] BlockStatement
src/main/utils/bookUtils.js:38:23
 };
 
 // add a book to local storage
-const add = (book) => {
-    const bookCollection = get();
-    book = { ...book, id: bookCollection.nextId };
-    bookCollection.nextId++;
-    bookCollection.books.push(book);
-    set(bookCollection);
-    return book;
-};
+const add = (book) => {};
 
 // update a book in local storage
killedBy: bookUtils tests add Starting from [], check that adding one book works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ObjectLiteral
src/main/utils/bookUtils.js:40:12
 // add a book to local storage
 const add = (book) => {
     const bookCollection = get();
-    book = { ...book, id: bookCollection.nextId };
+    book = {};
     bookCollection.nextId++;
     bookCollection.books.push(book);
killedBy: bookUtils tests add Starting from [], check that adding one book works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "author": "Daniel James Brown",
-   "date": "2013-07-04",

[Killed] UpdateOperator
src/main/utils/bookUtils.js:41:5
 const add = (book) => {
     const bookCollection = get();
     book = { ...book, id: bookCollection.nextId };
-    bookCollection.nextId++;
+    bookCollection.nextId--;
     bookCollection.books.push(book);
     set(bookCollection);
killedBy: bookUtils tests add Starting from [], check that adding one book works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 1

[Killed] BlockStatement
src/main/utils/bookUtils.js:48:26
 };
 
 // update a book in local storage
-const update = (book) => {
-    const bookCollection = get();
-
-    const books = bookCollection.books;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = books.findIndex((r) => r.id == book.id);
-    if (index === -1) {
-        return { "error": `book with id ${book.id} not found` };
-    }
-    books[index] = book;
-    set(bookCollection);
-    return { bookCollection: bookCollection };
-};
+const update = (book) => {};
 
 // delete a book from local storage
killedBy: bookUtils tests update Check that updating an existing book works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/bookUtils.js:54:35
     const books = bookCollection.books;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = books.findIndex((r) => r.id == book.id);
+    const index = books.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `book with id ${book.id} not found` };
killedBy: bookUtils tests update Check that updating an existing book works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 30
+ Received  +  1

  Object {
-   "bookCollection": Object {
-     "books": Array [

[Killed] EqualityOperator
src/main/utils/bookUtils.js:54:42
     const books = bookCollection.books;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = books.findIndex((r) => r.id == book.id);
+    const index = books.findIndex((r) => r.id != book.id);
     if (index === -1) {
         return { "error": `book with id ${book.id} not found` };
killedBy: bookUtils tests update Check that updating an existing book works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

@@ -4,21 +4,21 @@
        Object {
          "author": "George Orwell",

[Killed] ConditionalExpression
src/main/utils/bookUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == book.id);
-    if (index === -1) {
+    if (false) {
         return { "error": `book with id ${book.id} not found` };
     }
killedBy: bookUtils tests update Check that updating an non-existing book returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 29

  Object {
-   "error": "book with id 99 not found",
+   "bookCollection": Object {

[Killed] ConditionalExpression
src/main/utils/bookUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == book.id);
-    if (index === -1) {
+    if (true) {
         return { "error": `book with id ${book.id} not found` };
     }
killedBy: bookUtils tests update Check that updating an existing book works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 30
+ Received  +  1

  Object {
-   "bookCollection": Object {
-     "books": Array [

[Killed] ObjectLiteral
src/main/utils/bookUtils.js:56:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == book.id);
     if (index === -1) {
-        return { "error": `book with id ${book.id} not found` };
+        return {};
     }
     books[index] = book;
killedBy: bookUtils tests update Check that updating an non-existing book returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "book with id 99 not found",
- }

[Killed] BlockStatement
src/main/utils/bookUtils.js:64:21
 };
 
 // delete a book from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const bookCollection = get();
-    const books = bookCollection.books;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = books.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `book with id ${id} not found` };
-    }
-    books.splice(index, 1);
-    set(bookCollection);
-    return { bookCollection: bookCollection };
-};
+const del = (id) => {};
 
 const bookUtils = {
killedBy: bookUtils tests del Check that deleting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/main/utils/bookUtils.js:65:27
 
 // delete a book from local storage
 const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
+    if (id === undefined) {}
     const bookCollection = get();
     const books = bookCollection.books;
killedBy: bookUtils tests del Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "id is a required parameter",
+   "error": "book with id undefined not found",

[Killed] ConditionalExpression
src/main/utils/bookUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (true) {
         return { "error": `book with id ${id} not found` };
     }
killedBy: bookUtils tests del Check that deleting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 21
+ Received  +  1

  Object {
-   "bookCollection": Object {
-     "books": Array [

[Killed] EqualityOperator
src/main/utils/bookUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = books.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `book with id ${id} not found` };
     }
killedBy: bookUtils tests del Check that deleting a book by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 21
+ Received  +  1

  Object {
-   "bookCollection": Object {
-     "books": Array [

[Killed] ObjectLiteral
src/main/utils/bookUtils.js:81:19
     return { bookCollection: bookCollection };
 };
 
-const bookUtils = {
-    get,
-    getById,
-    add,
-    update,
-    del
-};
+const bookUtils = {};
 
 export { bookUtils };
killedBy: bookUtils tests get When books is undefined in local storage, should set to empty list
statusReason: TypeError: _bookUtils.bookUtils.get is not a function
